src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <owners>Catalog.НаборыЕдиницИзмерения</owners>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоКлассификатору</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВладельца</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>mega_Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>mega_Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>mega_Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>mega_ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>mega_КоличествоНаПоддоне</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>mega_ВидПоддона</name>
    <type>
      <types>EnumRef.mega_ВидыПоддонов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ВесИОбъемЕдиницТоваров/ВесИОбъемЕдиницТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВесИОбъемЕдиницТоваров</name>
  <resources>
    <name>Вес</name>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </resources>
  <resources>
    <name>mega_ВесНетто</name>
    <comment>Вес нетто (кг)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </resources>
  <resources>
    <name>mega_Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>mega_Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>mega_Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>mega_КоличествоНаПоддоне</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>mega_ВидПоддона</name>
    <type>
      <types>EnumRef.mega_ВидыПоддонов</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияИзмененийЕдиницИзмерения/ИсторияИзмененийЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийЕдиницИзмерения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоэффициентДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПосле</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецЕдиницыИзмерения</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
      <types>CatalogRef.НаборыЕдиницИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтараяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ЕдиницыИзмерения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
Перем КоэффициентПередЗаписью;
Перем ЕдиницаПоКлассификаторуПередЗаписью;
#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ФормироватьПечатныйДокументВПользовательскойЕдинице = Перечисления.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице;
	Если Константы.ПечатьПользовательскихЕдиницИзмерения.Получить() = ФормироватьПечатныйДокументВПользовательскойЕдинице Тогда
		
		ПроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияПоКлассификатору");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа 
		И ЗначениеЗаполнено(Владелец)
		И Не ЗначениеЗаполнено(ЕдиницаИзмеренияВладельца) Тогда
		ЕдиницаИзмеренияВладельца = Владелец.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		КоэффициентПередЗаписью = Ссылка.Коэффициент;
		ЕдиницаПоКлассификаторуПередЗаписью = Ссылка.ЕдиницаИзмеренияПоКлассификатору;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВесИОбъемЕдиницыТовара();
	
	Если Не ЭтоГруппа Тогда
		ЗаписатьИнформациюОСменеЕдиницыИзмерения(Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВесИОбъемЕдиницыТовара()
	
	Если Не ДополнительныеСвойства.Свойство("УказатьВесИОбъемДляЕдиницыТовара") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВесИОбъемЕдиницТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(Ссылка);
	
	Если ТипЗнч(Владелец) <> Тип("СправочникСсылка.Номенклатура") Тогда
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.УказатьВесИОбъемДляЕдиницыТовара Тогда
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Номенклатура = Владелец;
	Запись.ЕдиницаИзмерения = Ссылка;
	Запись.Вес = ДополнительныеСвойства.Вес;
	Запись.Объем = ДополнительныеСвойства.Объем;
	//+mega
	Запись.mega_ВесНетто = ДополнительныеСвойства.mega_ВесНетто;
	Запись.mega_ВидПоддона = ДополнительныеСвойства.mega_ВидПоддона;
	Запись.mega_КоличествоНаПоддоне = ДополнительныеСвойства.mega_КоличествоНаПоддоне;
	Запись.mega_Высота = ДополнительныеСвойства.mega_Высота;
	Запись.mega_Длина = ДополнительныеСвойства.mega_Длина;
	Запись.mega_Ширина = ДополнительныеСвойства.mega_Ширина;
	//-mega
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьИнформациюОСменеЕдиницыИзмерения(Отказ)
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Если Не КоэффициентПередЗаписью = Коэффициент
		Или Не ЕдиницаПоКлассификаторуПередЗаписью = ЕдиницаИзмеренияПоКлассификатору Тогда
		
		МенеджерЗаписи = РегистрыСведений.ИсторияИзмененийЕдиницИзмерения.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.ВладелецЕдиницыИзмерения = Ссылка;
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.СтараяЕдиницаИзмерения = ЕдиницаПоКлассификаторуПередЗаписью;
		МенеджерЗаписи.НоваяЕдиницаИзмерения = ЕдиницаИзмеренияПоКлассификатору;
		МенеджерЗаписи.КоэффициентДО = КоэффициентПередЗаписью;
		МенеджерЗаписи.КоэффициентПосле = Коэффициент;

		МенеджерЗаписи.Записать()
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
